---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetConnectedElementIds
source: html/0c30ce4f-eef8-fd20-529f-c7b0983998dc.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandler.GetConnectedElementIds Method

Retrieves list of element ids of connected elements.

## Syntax (C#)
```csharp
public IList<ElementId> GetConnectedElementIds()
```

## Returns
Returns connected element ids.